{"index":{"_id":1}}
{"text" : "Проце́сс — выполнение пассивных инструкций компьютерной программы на процессоре ЭВМ. Стандарт ISO 9000:2000 Definitions определяет процесс как совокупность взаимосвязанных и взаимодействующих действий, преобразующих входящие данные в исходящие. Компьютерная программа сама по себе — лишь пассивная последовательность инструкций. В то время как процесс — непосредственное выполнение этих инструкций. Также, процессом называют выполняющуюся программу и все её элементы: адресное пространство, глобальные переменные, регистры, стек, открытые файлы и так далее." }
{"index" : {"_id":2}}
{"text" : "Не очень строгий перевод материала mrbook.org/tutorials/make Мне в свое время очень не хватило подобной методички для понимания базовых вещей о make. Думаю, будет хоть кому-нибудь интересно. Хотя эта технология и отмирает, но все равно используется в очень многих проектах. Кармы на хаб «Переводы» не хватило, как только появится возможность — добавлю и туда. Добавил в Переводы. Если есть ошибки в оформлении, то прошу указать на них. Буду исправлять."}
{"index" : {"_id":3}}
{"text" : "Про́со — род однолетних и многолетних травянистых растений семейства Злаки, или Мятликовые. В Азии, Америке, Африке, Европе произрастает до 442 видов проса, в России — 8 видов этого растения. Среди других злаковых просо отличается повышенной стойкостью, пригодно для выращивания на сухой почве, хорошо переносит жару."}
{"index" : {"_id":4}}
{"text" : "Этой королеве не поставили ни одного памятника на родине (есть памятник на родине мужа — в Испании), её имя ассоциируется с кровавыми расправами, день её смерти (и одновременно день восшествия на престол Елизаветы I) отмечали в стране как национальный праздник."}
{"index": {"_id":5}}
{"text" : "Джейн Грей (англ. Lady Jane Grey, 1537 — 12 февраля 1554), в браке с 25 мая 1553 года Джейн Дадли (Jane Dudley) — некоронованная королева Англии с 10 по 19 июля 1553 года, в народном предании — «королева девяти дней». Правнучка короля Генриха VII, дочь герцога Саффолка выросла в протестантской среде и получила превосходное для своего времени образование. При жизни короля Эдуарда VI, будучи четвёртой в очереди престолонаследия, она имела лишь призрачные шансы прийти к власти[комм. 1]: наследницей короля-подростка была его старшая сестра Мария. Однако в июне 1553 года смертельно больной Эдуард и регент Джон Дадли отстранили католичку Марию от престолонаследия и назначили наследницей шестнадцатилетнюю протестантку Джейн, недавно выданную замуж за Гилфорда, сына регента. После смерти Эдуарда она была провозглашена королевой в Лондоне, а Мария возглавила вооружённый мятеж в Восточной Англии. Девять дней спустя Тайный совет, оценив соотношение сил, низложил Джейн и призвал на трон Марию. Джейн Грей и её муж были заключены в Тауэр, приговорены к смерти за измену и семь месяцев спустя обезглавлены."}
{"index": {"_id":6}}
{"text" : "Быстренькая жопка быстрая"}
{"index": {"_id":7}}
{"text" : "Американец юный Гуль убит был доктором Мабузо"}
{"index": {"_id":8}}
{"text" : "Кораблекрушение — катастрофа, произошедшая с судном, обычно приводящая к его сильному разрушению или гибели."}
